[
  {
    "title": "Toy Story",
    "story_line": "In a world where toys are living things who pretend to be lifeless when humans are present, a group of toys, owned by six-year-old Andy Davis, are caught off-guard when Andy's birthday party is moved up a week, as Andy, his mother and infant sister Molly are preparing to move the following week. The toys' leader and Andy's favorite toy, an old-fashioned cowboy doll named Sheriff Woody organizes the other toys, including Bo Peep the shepherdess, Mr. Potato Head, Rex the Dinosaur, Hamm the Piggy Bank and Slinky Dog, into a scouting mission. Green army men, led by Sarge, spy on the party and report the results to the others via baby monitors. The toys are relieved when the party appears to end with none of them having been replaced, but then Andy receives a surprise gift – an electronic toy space ranger action figure named Buzz Lightyear, who believes that he is an actual space ranger.",
    "trailer_youtube_url": "https://www.youtube.com/watch?v=KYz2wyBy3kc",
    "poster_image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0a/Toy_Story_logo.svg/1200px-Toy_Story_logo.svg.png"
  },
  {
    "title": "Avatar",
    "story_line": "By 2154, humans have depleted Earth's natural resources, leading to a severe energy crisis. The Resources Development Administration (RDA for short) mines for a valuable mineral — unobtanium — on Pandora, a densely forested habitable moon orbiting the gas giant Polyphemus in the Alpha Centauri star system.[10] Pandora, whose atmosphere is poisonous to humans, is inhabited by the Na'vi, a species of 10-foot tall (3.0 m), blue-skinned, sapient humanoids[34] that live in harmony with nature and worship a mother goddess named Eywa.To explore Pandora's biosphere, scientists use Na'vi-human hybrids called \"avatars,\" operated by genetically matched humans; Jake Sully, a paraplegic former Marine, replaces his deceased identical twin brother as an operator of one. Dr. Grace Augustine, head of the Avatar Program, considers Sully an inadequate replacement but accepts his assignment as a bodyguard. While protecting the avatars of Grace and fellow scientist Dr. Norm Spellman as they collect biological data, Jake's avatar is attacked by a thanator and flees into the forest, where he is rescued by Neytiri, a female Na'vi. Witnessing an auspicious sign, she takes him to her clan, whereupon Neytiri's mother Mo'at, the clan's spiritual leader, orders her daughter to initiate Jake into their society.",
    "trailer_youtube_url": "https://www.youtube.com/watch?v=5PSNL1qE6VY",
    "poster_image_url": "https://upload.wikimedia.org/wikipedia/de/thumb/c/c1/Avatar_Schriftzug.jpg/280px-Avatar_Schriftzug.jp"
  },
  {
    "title": "Das Boot",
    "story_line": "The plot begins in La Rochelle in October 1941. German U-boats are ordered to sink British freighters in the North Atlantic. After initial successes, U-boats are encountering more and more difficulties, as British destroyers and, increasingly, airplanes, are defending the freighters sailing in convoy more and more effectively.Lt. Werner (Herbert Grönemeyer), has been assigned as a war correspondent on the German submarine U-96. He meets its captain (Jürgen Prochnow), chief engineer (Klaus Wennemann), and the crew in a raucous French bordello. The captain, and most of the officers, are never named, and referred to by (abbreviations of) their rank. Thomsen (Otto Sander), another captain, gives a crude drunken speech to celebrate his Ritterkreuz award, in which he openly mocks not only Winston Churchill but implicitly Adolf Hitler as well. The next morning, they sail out of the harbour of La Rochelle to a cheering crowd and playing band. Werner is given a tour of the boat, learning that he is one of few crew members not required to share a bunk.",
    "trailer_youtube_url": "https://www.youtube.com/watch?v=7pzKyeIex2Y",
    "poster_image_url": "https://duckduckgo.com/i/de80148e.png"
  }
]